// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "亲爱的爸爸",  // 同上...
        "今天是你的生日",
        "祝您生日快乐",
        "体健康寿",
        "岁月深深藏大爱，福音阵阵润心田",
        "曾经困苦身心痛，此岁悠哉万事全",
        "往事如烟回首望，安康福寿奏管弦",
        "愿您和妈妈福如东海",
        "寿比南山",
        "生日快乐~",
        "生日快乐~~",
        "生日快乐~~~",
        "生日快乐~~~~",
        "生日快乐~~~~~",
        "生日快乐~~~~~~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "送给我" : './imgs/f1773f13982755fe932c9afd8b7cd17.jpg',      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "亲爱的爸爸" : './imgs/4d19adba1f083ccff7464f8ba870b6e.jpg',  // 同上...
        "今天是你的生日" : './imgs/4ea8eac0188f7ef649c54d7ef105c96.jpg',
        "祝您生日快乐" : './imgs/8d9f72958b74e5b359f16dfdd8a7ea2.jpg',
        "体健康寿" : './imgs/b7a4ba791100cf09271679fd2d2563c.jpg',
        "岁月深深藏大爱，福音阵阵润心田" : './imgs/41c566d62caf85c4acd6482073055b0.jpg',
        "曾经困苦身心痛，此岁悠哉万事全" : './imgs/d36a5a0e975817879145401c5c85eea.jpg',
        "往事如烟回首望，安康福寿奏管弦" : './imgs/ec2ee71875dda9f897855764454e2bb.jpg',
        "愿您和妈妈福如东海" : './imgs/4ea8eac0188f7ef649c54d7ef105c96.jpg',
        "寿比南山": './imgs/IMG_1259.JPG',
        "生日快乐~": './imgs/13351777650935940.jpeg',
        "生日快乐~~": './imgs/IMG_1714.JPG',
        "生日快乐~~~": './imgs/微信图片_20240207190804.jpg',
        "生日快乐~~~~": './imgs/微信图片_20240207191238.jpg',
        "生日快乐~~~~~": './imgs/微信图片_20240207191242.jpg',
        "生日快乐~~~~~~": './imgs/微信图片_20240207191247.jpg',
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
